wcalvert/erpc/LPC11U_LPC13U/src/boards/lpcxpresso11u37/board_lpcxpresso11u37.h
/**************************************************************************/
/*!
    @file     board_lpcxpresso11u37.h
    @author   K. Townsend (microBuilder.eu)

    @brief    Board file for the LPC1347 LPCXpresso board from NXP
    @ingroup  Boards

    @section LICENSE

    Software License Agreement (BSD License)

    Copyright (c) 2012 K. Townsend
    All rights reserved.

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
    1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holders nor the
    names of its contributors may be used to endorse or promote products
    derived from this software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ''AS IS'' AND ANY
    EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
    DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
/**************************************************************************/
#ifndef __BOARD_LPCXPRESSO11U37_H__
#define __BOARD_LPCXPRESSO11U37_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "sysdefs.h"

/*=========================================================================
    MCU SELECTION

    Include one of the following definitions depending on if you are
    using the LPC11U37 or LPC1347.  They're generally interchangeable, but
    the LPC11Uxx and LPC13xx CMSIS implementations have some differences
    in naming convention, and occasionally a feature is only available on
    the M3 (DWT for example).  Selecting the appropriate MCU allows
    the right code to be included when differences between the CMSIS
    implementations are present.

    -----------------------------------------------------------------------*/
    // #define CFG_MCU_LPC11U24FBD48_401
    #define CFG_MCU_LPC11U37FBD48_401
    // #define CFG_MCU_LPC1347FBD48
    // #define CFG_MCU_LPC1347FHN33

    /* Basic error checking */
    #if !defined CFG_MCU_LPC1347FBD48 && \
        !defined CFG_MCU_LPC11U37FBD48_401 && \
        !defined CFG_MCU_LPC11U24FBD48_401 && \
        !defined CFG_MCU_LPC1347FHN33
      #error "An MCU must be selected in projectconfig.h (Ex. CFG_MCU_LPC11U37FBD48_401, CFG_MCU_LPC1347FBD48, etc.)"
    #endif

    /* Set flag to indicate which CMSIS library to use */
    #if (defined CFG_MCU_LPC1347FBD48 || defined CFG_MCU_LPC1347FHN33)
      #define CFG_MCU_FAMILY_LPC13UXX
    #elif (defined CFG_MCU_LPC11U24FBD48_401 || defined CFG_MCU_LPC11U37FBD48_401)
      #define CFG_MCU_FAMILY_LPC11UXX
    #endif

    /* Include the correct MCU header file */
    #if defined CFG_MCU_FAMILY_LPC13UXX
      #include "LPC13Uxx.h"
    #endif
    #if defined CFG_MCU_FAMILY_LPC11UXX
      #include "LPC11Uxx.h"
    #endif
/*=========================================================================*/


/*=========================================================================
    FIRMWARE VERSION SETTINGS
    -----------------------------------------------------------------------*/
    #define CFG_FIRMWARE_VERSION_MAJOR      (0)
    #define CFG_FIRMWARE_VERSION_MINOR      (0)
    #define CFG_FIRMWARE_VERSION_REVISION   (0)
/*=========================================================================*/


/*=========================================================================
    PIN USAGE
    -----------------------------------------------------------------------
    This table tries to give an indication of which GPIO pins and
    peripherals are used by the available drivers and SW examples.  Only
    dedicated GPIO pins available on the LPC1347 Reference Board are shown
    below.  Any unused peripheral blocks like I2C, SSP, ADC, etc., can
    also be used as GPIO if they are available.

                PORT 0
                =========================================================
                0 1 2 3 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23

    HX8340B     . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    HX8347G     . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    CHIBI       . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    SSD1306 I2C . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    FAT32/MMC   . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  X  .  .
    PN532 I2C   . . . . . . . .  .  .  .  .  .  .  X  X  .  .  .  .  .  .
    PCF2129A    . . . . . . . .  .  .  .  .  .  .  X  X  .  .  .  .  .  .

                PORT 1
                ===========================================================================
                0 1 2 3 4 5 7 8 10 11 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 31
                + + + + + + + +  +  +              +  +                                   -

    HX8340B     . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  X  X  X  X  X  .
    HX8347G     . . . . . . . .  .  .  X  X  X  X  .  .  X  X  X  X  X  X  X  X  X  X  .  .
    CHIBI       . . . . . . . .  .  .  X  X  X  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    SSD1306 I2C . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    FAT32/MMC   . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  X  X  .  .  .  .  .  .
    PN532 I2C   . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
    PCF2129A    . . . . . . . .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .

                TIMERS                   SSP   ADC               UART
                ======================   ===   ===============   ====
                16B0  16B1  32B0  32B1   0 1   0 1 2 3 4 5 6 7   0

    HX8340B     .      .    .     .      . .   . . . . . . . .   .
    HX8347G     .      .    .     .      . .   . . . . . . . .   .
    CHIBI       .      .    .     .      X .   . . . . . . . .   .
    SSD1306 I2C .      .    .     .      . .   . . . . . . . .   .
    FAT32/MMC   .      .    .     .      . X   . . . . . . . .   .

    [+]   Only available on QFP64 package
    [-]   Only available on QFP48 package

  =========================================================================*/


/*=========================================================================
    GPIO INTERRUPTS
    -----------------------------------------------------------------------
    This table shows where GPIO interrupts are mapped in this project
    (Note that the LPC11U and LPC13U use different names for the
    IRQ Handlers in the standard headers)

    Interrupt                                     Location
    ------------------------------------------    -------------------------
    PIN_INT0_IRQHandler - FLEX_INT0_IRQHandler    chb_drvr.c
    PIN_INT1_IRQHandler - FLEX_INT1_IRQHandler    pcf2129.c
    PIN_INT2_IRQHandler - FLEX_INT2_IRQHandler    spi.c (cc3000)
    PIN_INT3_IRQHandler - FLEX_INT3_IRQHandler
    PIN_INT4_IRQHandler - FLEX_INT4_IRQHandler
    PIN_INT5_IRQHandler - FLEX_INT5_IRQHandler
    PIN_INT6_IRQHandler - FLEX_INT6_IRQHandler
    PIN_INT7_IRQHandler - FLEX_INT7_IRQHandler
    GINT0_IRQHandler
    GINT0_IRQHandler
    -----------------------------------------------------------------------*/
/*=========================================================================*/


/*=========================================================================
    SUPPORTED PERIPHERALS
    -----------------------------------------------------------------------
    Because all ISRs are referenced in the startup code, GCC typically
    won't optimise out the ISR functions during compilation even if the
    ISRs will never be entered, resulting in larger binaries than required
    (for example if no I2C sensors are used, be sure to disable I2C support
    since the I2C ISR is quite large).

    Use the defines below to include or exclude support for specific
    peripherals.

    NOTE: GPIO ISRs are handled separately in GPIO INTERRUPTS below
    -----------------------------------------------------------------------*/
    #define CFG_ENABLE_I2C
    #define CFG_ENABLE_UART
    #define CFG_ENABLE_USB
    #define CFG_ENABLE_TIMER32
/*=========================================================================*/


/*=========================================================================
    ENABLE CMSIS-RTOS

    -----------------------------------------------------------------------*/
    // #define CFG_CMSIS_RTOS

    #if defined CFG_CMSIS_RTOS
      #include "board_lpcxpresso11u37_rtxconf.h"
    #endif
/*=========================================================================*/


/*=========================================================================
    EEPROM
    -----------------------------------------------------------------------
    EEPROM is used to persist certain user modifiable values to make
    sure that these changes remain in effect after a reset or hard
    power-down.  The addresses in EEPROM for these various system
    settings/values are defined below.  The first 256 bytes of EEPROM
    are reserved for this (0x0000..0x00FF).

    CFG_EEPROM_SIZE           The number of bytes available on the EEPROM
    CFG_EEPROM_RESERVED       The last byte of reserved EEPROM memory

          EEPROM Address (0x0000..0x00FF)
          ===============================
          0 1 2 3 4 5 6 7 8 9 A B C D E F
    000x  x x . . x x x x x x x x . . . .   Chibi
    001x  . . . . . . . . . . . . . . . .
    002x  . . . . . . . . . . . . . . . .
    003x  . . . . . . . . . . . . . . . .
    004x  . . . . . . . . . . . . . . . .
    005x  . . . . . . . . . . . . . . . .
    006x  . . . . . . . . . . . . . . . .
    007x  . . . . . . . . . . . . . . . .
    008x  . . . . . . . . . . . . . . . .
    009x  . . . . . . . . . . . . . . . .
    00Ax  . . . . . . . . . . . . . . . .
    00Bx  . . . . . . . . . . . . . . . .
    00Cx  . . . . . . . . . . . . . . . .
    00Dx  . . . . . . . . . . . . . . . .
    00Ex  . . . . . . . . . . . . . . . .
    00Fx  . . . . . . . . . . . . . . . .

    -----------------------------------------------------------------------*/
    #define CFG_EEPROM_SIZE                   (4032)
    #define CFG_EEPROM_RESERVED               (0x00FF)              // Protect first 256 bytes of memory
    #define CFG_EEPROM_CHIBI_NODEADDR         (uint16_t)(0x0000)    // 2
    #define CFG_EEPROM_CHIBI_IEEEADDR         (uint16_t)(0x0004)    // 8
/*=========================================================================*/


/*=========================================================================
    ON-BOARD LED
    -----------------------------------------------------------------------

